[0] D. Jiet al. 2018. A Multiband Directional Coupler Using SOI CMOS for RF Front-End Applications. IEEE Microwave and Wireless Components Letters. PP, 2 (2018), 126-128. DOI:https://doi.org/10.1109/LMWC.2017.2783196

[0] R. Wanget al. 2018. A Sub-1ppm/ #x00B0;C Current-Mode CMOS Bandgap Reference With Piecewise Curvature Compensation. IEEE Transactions on Circuits and Systems I: Regular Papers. PP, 3 (2018), 904-913. DOI:https://doi.org/10.1109/TCSI.2017.2771801

[0] S. N. Mozaffariet al. 2018. A Generalized Approach to Implement Efficient CMOS-Based Threshold Logic Functions. IEEE Transactions on Circuits and Systems I: Regular Papers. PP, 3 (2018), 946-959. DOI:https://doi.org/10.1109/TCSI.2017.2768563

[0] Q. Qiet al. 2018. A $K$ -Band CMOS Amplifier With Temperature Compensation for Gain Variation Reduction. IEEE Microwave and Wireless Components Letters. PP, 2 (2018), 150-152. DOI:https://doi.org/10.1109/LMWC.2017.2786658

[0] D. R. Wuet al. 2018. Crosstalk Between Single-Photon Avalanche Diodes in a 0.18- #956;m High-Voltage CMOS Process. Journal of Lightwave Technology. PP, 3 (2018), 833-837. DOI:https://doi.org/10.1109/JLT.2017.2779490

[0] E. Kargaranet al. 2018. Design and Analysis of 2.4 GHz $30~mu text{W}$ CMOS LNAs for Wearable WSN Applications. IEEE Transactions on Circuits and Systems I: Regular Papers. PP, 3 (2018), 891-903. DOI:https://doi.org/10.1109/TCSI.2017.2771940

[0] M. Taghadosiet al. 2018. High Efficiency Energy Harvesters in 65nm CMOS Process for Autonomous IoT Sensor Applications. IEEE Access. PP, 12 (2018), 2397-2409. DOI:https://doi.org/10.1109/ACCESS.2017.2783045

[0] R. Mirabelliet al. 2018. The MONDO Detector Prototype Development and Test: Steps Toward an SPAD-CMOS-Based Integrated Readout (SBAM Sensor). IEEE Transactions on Nuclear Science. PP, 2 (2018), 744-751. DOI:https://doi.org/10.1109/TNS.2017.2785768

[0] F. Staset al. 2018. A 0.4-V 0.66-fJ/Cycle Retentive True-Single-Phase-Clock 18T Flip-Flop in 28-nm Fully-Depleted SOI CMOS. IEEE Transactions on Circuits and Systems I: Regular Papers. PP, 3 (2018), 935-945. DOI:https://doi.org/10.1109/TCSI.2017.2763423

[0] H. Ramonet al. 2018. Low-Power 56Gb/s NRZ Microring Modulator Driver in 28nm FDSOI CMOS. IEEE Photonics Technology Letters. PP, 5 (2018), 467-470. DOI:https://doi.org/10.1109/LPT.2018.2799004

